{
  "brands": [
    {
      "id": 1,
      "name": "Lindt & Sprungli",
      "logo": "http://localhost:4000/images/Lindt.png",
      "desc":
        "Chocoladefabriken Lindt & Sprüngli AG, more commonly known as Lindt, is a Swiss chocolatier and confectionery company founded in 1845 and known for their chocolate truffles and chocolate bars, among other sweets."
    },
    {
      "id": 2,
      "name": "Ferrero",
      "logo": "http://localhost:4000/images/ferrero.png",
      "desc":
        "Ferrero SpA (Italian pronunciation: [ferˈrɛːro]) is an Italian manufacturer of branded chocolate and confectionery products and it is the third biggest chocolate producer and confectionery company in the world. It was founded in 1946 in Alba, Piedmont, Italy, by Pietro Ferrero, a confectioner and small-time pastry maker who laid the groundwork for Nutella and famously added hazelnut to save money on chocolate. The company saw a period of tremendous growth and success under Pietro's son Michele Ferrero, who in turn handed over the daily operations to his sons. His son Pietro (the founder's grandson), who oversaw global business, died on April 18, 2011, in a cycling accident in South Africa at the age of 47. The Ferrero Group worldwide – now headed by CEO Giovanni Ferrero – includes 38 trading companies, 18 factories, approximately 21,500 employees and produces around 365,000 tonnes of Nutella each year. Ferrero International SA's headquarters is in Luxembourg. Ferrero SpA is a private company owned by the Ferrero family and has been described as one of the world's most secretive firms. ReputationInstitute's 2009 survey ranks Ferrero as the most reputable company in the world.The recently announced financial results for the fiscal year ending August 31, 2016 showed consolidated sales growth of 8.2% from the previous fiscal year."
    },
    {
      "id": 3,
      "name": "Ghirardelli",
      "logo": "http://localhost:4000/images/ghirardelli.png",
      "desc":
        "The Ghirardelli Chocolate Company is a United States division of Swiss confectioner Lindt & Sprüngli. The company was founded by and is named after Italian chocolatier Domenico Ghirardelli,[1] who, after working in South America, moved to California. The Ghirardelli Chocolate Company was incorporated in 1852, and is the third-oldest chocolate company in the United States, after Baker's Chocolate and Whitman's."
    },
    {
      "id": 4,
      "name": "Hershey's",
      "logo": "http://localhost:4000/images/hersheys.png",
      "desc":
        "The Hershey Company, known until April 2005 as the Hershey Foods Corporation[4] and commonly called Hershey's, is an American company and one of the largest chocolate manufacturers in the world. Its headquarters are in Hershey, Pennsylvania, which is also home to Hershey's Chocolate World. It was founded by Milton S. Hershey in 1894 as the Hershey Chocolate Company, a subsidiary of his Lancaster Caramel Company. Hershey's products are sold in over 60 countries worldwide.In addition, Hershey is a member of the World Cocoa Foundation. It is also associated with the Hersheypark Stadium and the Giant Center."
    },
    {
      "id": 5,
      "name": "Guylian",
      "logo": "http://localhost:4000/images/guliyan.png",
      "desc":
        "Guylian (Dutch pronunciation: ['ɡilijan]) is a Belgian chocolate manufacturer founded by Guy Foubert in 1958. The company takes its name from the combination of Foubert's first name with that of his wife, Liliane. Guylian is perhaps most famous for their production of chocolate Sea Shells praline with different fillings. Guylian has been the major sustaining sponsor of Project Seahorse since 1999"
    },
    {
      "id": 6,
      "name": "Godiva",
      "logo": "http://localhost:4000/images/godiva.jfif",
      "desc":
        "Godiva Chocolatier is a manufacturer of premium fine chocolates and related products. Godiva, founded in Belgium in 1926, was purchased by the Turkish Yıldız Holding, owner of the Ülker Group, on November 20, 2007. Godiva owns and operates more than 600 retail boutiques and shops in the United States, Canada, Europe, and Asia and is available via over 10,000 specialty retailers."
    },
    {
      "id": 7,
      "name": "Toblerone",
      "logo": "http://localhost:4000/images/tobelron.jfif",
      "desc":
        "Toblerone (/ˈtoʊbləroʊn/; German: [tobləˈroːnə]) is a Swiss chocolate bar brand[1] owned by US confectionery company Mondelēz International, Inc., formerly Kraft Foods, which acquired the product from former owner Jacobs Suchard in 1990. It is produced in Bern[2] (the bear symbol of the city is still visible in the logo) and in early 2000 was being produced in the United States by Ferrara Pan candy company in Bellwood, Illinois.[citation needed] Toblerone is well known for its distinctive triangular prism shape."
    },
    {
      "id": 8,
      "name": "Cadbury",
      "logo": "http://localhost:4000/images/cadbury.png",
      "desc":
        "Cadbury, formerly Cadbury's, is a British multinational confectionery company wholly owned by Mondelez International (originally Kraft Foods) since 2010. It is the second-largest confectionery brand in the world after Wrigley's. Cadbury is internationally headquartered in Uxbridge, West London, and operates in more than 50 countries worldwide. It is famous for its Dairy Milk chocolate, the Creme Egg and Roses selection box, and many other confectionery products. One of the best-known British brands, in 2013 The Daily Telegraph named Cadbury among Britain's most successful exports"
    },
    {
      "id": 9,
      "name": "Dove",
      "logo": "http://localhost:4000/images/dove.jfif",
      "desc":
        "Dove (sold as Galaxy in the United Kingdom, Isle of Man, India, and Ireland) is a brand of chocolate made and marketed by the Mars company. Dove produces a wide range of chocolate bars, including dark chocolate, milk, caramel, fruit and nut varieties, truffle and chocolate pieces with a folded milk chocolate center."
    },
    {
      "id": 10,
      "name": " Reese's",
      "logo": "http://localhost:4000/images/reeses.png",
      "desc":
        "Reese's Peanut Butter Cups are a popular American candy consisting of a milk, white, or dark chocolate cup filled with peanut butter, marketed by The Hershey Company. They were created in 1928 by H. B. Reese, a former dairy farmer and shipping foreman for Milton S. Hershey. Reese was inspired by Hershey and left dairy farming to start his own candy business."
    }
  ],
  "types": [
    {
      "id": 1,
      "name": "Milk chocolate"
    },
    {
      "id": 2,
      "name": "Dark chocolate"
    },
    {
      "id": 3,
      "name": "White chocolate"
    },
    {
      "id": 3,
      "name": "Raw chocolate"
    },
    {
      "id": 4,
      "name": "Unsweetened chocolate"
    },
    {
      "id": 5,
      "name": "Bittersweet chocolate"
    },
    {
      "id": 6,
      "name": "Semisweet chocolate"
    }
  ],
  "chocolates": [
    {
      "id": 1,
      "name": "Mint Intense",
      "brandId": 1,
      "desc": "dark chocolate infused with mint",
      "image": "http://localhost:4000/images/mint-intense.png"
    },
    {
      "id": 2,
      "name": "Orange Intense",
      "brandId": 1,
      "desc": "dark chocolate infused with orange essence and almond flakes",
      "image": "http://localhost:4000/images/orange-intense.jfif"
    },
    {
      "id": 3,
      "name": "Black Currant",
      "brandId": 1,
      "desc":
        "dark chocolate infused with pieces of black currant and almond slivers",
      "image": "http://localhost:4000/images/black-currant.jfif"
    },
    {
      "id": 4,
      "name": "White Coconut",
      "brandId": 1,
      "desc": "white chocolate with crisp flakes of fine coconut",
      "image": "http://localhost:4000/images/white-coconut.jfif"
    },
    {
      "id": 5,
      "name": "Lindor",
      "brandId": 1,
      "desc": "the famous balls but in cube form",
      "image": "http://localhost:4000/images/lindor.png"
    },
    {
      "id": 6,
      "name": "Wasabi",
      "brandId": 1,
      "desc": "an East Asian inspired dark chocolate mixed with Wasabi",
      "image": "http://localhost:4000/images/wasabi.jpg"
    },
    {
      "id": 7,
      "name": "Pocket Coffee",
      "brandId": 2,
      "desc": "Italian liquid espresso encased in a shell of dark chocolate",
      "image": "http://localhost:4000/images/pocket-coffe.jfif"
    },
    {
      "id": 8,
      "name": "Mon Chéri",
      "brandId": 2,
      "desc":
        "a single-wrapped combination consisting of a heart of cherry floating in a liqueur and contained in a bittersweet chocolate housing",
      "image": "http://localhost:4000/images/mon-cheri.jfif"
    },
    {
      "id": 9,
      "name": "Raffaello",
      "brandId": 2,
      "desc": "a spherical coconut-almond confection",
      "image": "http://localhost:4000/images/rafello.jfif"
    },
    {
      "id": 10,
      "name": "Kinder Joy",
      "brandId": 2,
      "desc":
        "contains layers of cocoa and milk-flavoured creams topped with two cocoa wafer spheres, to be eaten with an included spoon",
      "image": "http://localhost:4000/images/kinder.jfif"
    },
    {
      "id": 11,
      "name": "Mounds",
      "brandId": 3,
      "desc": " dark chocolate enrobed coconut base mixture",
      "image": "http://localhost:4000/images/mounds.jfif"
    },
    {
      "id": 12,
      "name": "Drops",
      "brandId": 3,
      "desc":
        "Circular-shaped chocolate candies based on two Hershey chocolate bars.",
      "image": "http://localhost:4000/images/drops.jfif"
    },
    {
      "id": 13,
      "name": "Bliss",
      "brandId": 3,
      "desc":
        "bite sized chocolates in a square shape and wrapped in foil, advertised as creamy and indulgent.",
      "image": "http://localhost:4000/images/bliss.jfif"
    }
  ],
  "users": [
    {
      "id": 1,
      "firstName": "Bala Krishna",
      "lastName": "Ragala",
      "email": "baluragala@gmail.com",
      "password": "zeo@123"
    }
  ]
}
